{
  "meetings": [
    {
      "isNext": false,
      "date": "December 4, 2018",
      "topic": "Java at Speed: Get the Most out of Modern Hardware",
      "abstract": "<p>Getting the most of your Java applications can be an interesting challenge. Understanding some of the optimizations the latest crop of JVMs are able to apply when running on the latest servers may help with that. This talk will discuss some of those features and optimizations. Along with discussing some JIT compiler capabilities, we will take a look at the evolution of Inte-based server platforms, quickly traversing through features that were introduced over the past few years. We will demonstrate some examples of JVM JITs using these capabilities where available, as they adapt the code they generate to the specific processors they run on.</p><p>If you like to geek out to the sound of mechanical sympathy discussions, this is the talk for you.</p>",
      "speaker": {
        "name": "Gil Tene, CTO & Co-Founder, Java Champion",
        "information": "<p>Gil Tene (Twitter: @giltene) is CTO and co-founder of Azul Systems. He has been involved with virtual machine technologies for the past 20 years and has been building Java technology-based products since 1995. Gil pioneered Azul’s Continuously Concurrent Compacting Collector (C4), Java Virtualization, Elastic Memory, and various managed runtime and systems stack technologies that combine to deliver the industry’s most scalable and robust Java platforms. Gil also represents Azul Systems on the JCP (Java Community Process) executive committee.</p><p>A frequent speaker and JavaOne “RockStar”, in September 2013 Gil was named “JCP member/participant of the year” at an awards ceremony at JavaOne. In December 2017 he was named a Java Champion, and in 2006 he was named one of the Top 50 Agenda Setters in the technology industry by Silicon.com.</p><p>Prior to co-founding Azul, Gil held key technology positions at Nortel Networks, Shasta Networks and at Check Point Software Technologies, where he delivered several industry-leading traffic management solutions including the industry’s first Firewall-1 based security appliance. He architected operating systems for Stratus Computer, clustering solutions at Qualix/Legato, and served as an officer in the Israeli Navy Computer R and D unit.</p><p>Gil holds a BSEE from The Technion Israel Institute of Technology, and has been awarded over 40 patents in computer-related technologies. <a href='http://stuff-gil-says.blogspot.com/' target='_blank'>You can read his blog here</a>.</p>"
      },
      "company": {
        "name": "Azul Corporation"
      },
      "location": "Ticketmaster, 7060 Hollywood Blvd, 3rd Floor, Hollywood, CA, 90028",
      "host": "Marco Villalobos"
    },
    {
      "isNext": true,
      "date": "November 13, 2018",
      "topic": "Reactive Applications on the JVM with Vert.x",
      "abstract": "John will give an introduction to Eclipse Vert.x, covering its asynchronous and reactive APIs for building distributed (reactive) systems. Vert.x is incredibly flexible – whether it’s simple network utilities, sophisticated modern web applications, REST services, high volume event processing or a full-blown back-end message-bus application. It also shines at scalable microservice systems, especially when running in a Kubernetes environment. John will show some slides, some microservice-y code, and deploying Vert.x applications to Kubernetes.",
      "speaker": {
        "name": "John Clingan, Senior Principal Product Manager",
        "information": "John is a Senior Principal Product Manager for the OpenShift Application Runtimes product, which optimizes Thorntail, Vert.x, Node.js, and Spring Boot for kubernetes/OpenShift. He is also an Eclipse MicroProfile co-founder, which delivers Microservices specifications for Enterprise Java. Prior to that, John was a product manager on the GlassFish Server and Java EE product team at Oracle Corporation and Sun Microsystems. He also has 10+ years of experience teaching Cal State and University of California Extension Java courses to intellectually hungry Java students. John was a regular LAJUG attendee until the location changed and he became a soccer dad."
      },
      "company": {
        "name": "Red Hat"
      },
      "location": "Ticketmaster, 7060 Hollywood Blvd, 3rd Floor, Hollywood, CA, 90028",
      "host": "Marco Villalobos"
    },
    {
      "isNext": false,
      "date": "October 2, 2018",
      "topic": "Get ready for an exciting but stormy 2019",
      "abstract": "<b>Get ready for an exciting but stormy 2019.</b><p>The Java world is in the midst of tectonic shift. With dramatic changes to the pace of feature introduction, release lifecycles, compatibility policies, security update policies, and the required pace of adoption in production all happening at the same time, the world ahead will look nothing like what you may have gotten used to. In the short talk, Gil Tene (CTO, Azul Systems) will provide a quick overview of what developers and operational people need to know if Java is part of their world.</p><b>Java at Speed: Get the Most out of Modern Hardware</b><p>Getting the most of your Java applications can be an interesting challenge. Understanding some of the optimizations the latest crop of JVMs are able to apply when running on the latest servers may help with that. This talk will discuss some of those features and optimizations. Along with discussing some JIT compiler capabilities, we will take a look at the evolution of Inte-based server platforms, quickly traversing through features that were introduced over the past few years. We will demonstrate some examples of JVM JITs using these capabilities where available, as they adapt the code they generate to the specific processors they run on.</p><p>If you like to geek out to the sound of mechanical sympathy discussions, this is the talk for you.</p>",
      "speaker": {
        "name": "Gil Tene, CTO & Co-Founder, Java Champion",
        "information": "<p>Gil Tene (Twitter: @giltene) is CTO and co-founder of Azul Systems. He has been involved with virtual machine technologies for the past 20 years and has been building Java technology-based products since 1995. Gil pioneered Azul’s Continuously Concurrent Compacting Collector (C4), Java Virtualization, Elastic Memory, and various managed runtime and systems stack technologies that combine to deliver the industry’s most scalable and robust Java platforms. Gil also represents Azul Systems on the JCP (Java Community Process) executive committee.</p><p>A frequent speaker and JavaOne “RockStar”, in September 2013 Gil was named “JCP member/participant of the year” at an awards ceremony at JavaOne. In December 2017 he was named a Java Champion, and in 2006 he was named one of the Top 50 Agenda Setters in the technology industry by Silicon.com.</p><p>Prior to co-founding Azul, Gil held key technology positions at Nortel Networks, Shasta Networks and at Check Point Software Technologies, where he delivered several industry-leading traffic management solutions including the industry’s first Firewall-1 based security appliance. He architected operating systems for Stratus Computer, clustering solutions at Qualix/Legato, and served as an officer in the Israeli Navy Computer R and D unit.</p><p>Gil holds a BSEE from The Technion Israel Institute of Technology, and has been awarded over 40 patents in computer-related technologies. <a href='http://stuff-gil-says.blogspot.com/' target='_blank'>You can read his blog here</a>.</p>"
      },
      "company": {
        "name": "Azul Corporation"
      },
      "location": "Ticketmaster, 7060 Hollywood Blvd, 3rd Floor, Hollywood, CA, 90028",
      "host": "Marco Villalobos"
    },
    {
      "isNext": false,
      "date": "September 11, 2018",
      "topic": "Accelerating the Future of Java",
      "abstract": "As one of the most pervasively used technologies in our lifetime, Java continues to innovate the application world around us. Through continued modernization Java offers developers a contemporary language and platform to create the next generation of rich, scalable, and secure enterprise applications. And as the technology landscape changes around us, often times at an ever-more increasing pace, Java is primed to offer developers continued uniqueness to address new-found opportunities. Hear from Georges Saab (VP, Java Platform Group and OpenJDK Chairperson) to learn how Oracle is continuing to steward ongoing Java technology enhancements by covering the Java release process, OpenJDK, Oracle JDK, and how licensing will affect companies.",
      "speaker": {
        "name": "Georges Saab",
        "information": "Georges Saab is the vice president of development for the Java Platform Group at Oracle. His group is responsible for Java Standard Edition including the Java language, core libraries, and the Java Virtual Machine. Georges is a veteran of programming language and platform development, with more than 25 years in this field. His work with the Java platform began as a developer of Java Standard Edition at JavaSoft and Sun Microsystems, where he was a founder of the Swing group and Java Webstart, and continued as he ran development of the JRockit JVM for many years at BEA Systems. Georges is the Chairperson of the OpenJDK governing board."
      },
      "company": {
        "name": "Oracle Corporation"
      },
      "location": "Ticketmaster, 7060 Hollywood Blvd, 3rd Floor, Hollywood, CA, 90028",
      "host": "Marco Villalobos"
    },
    {
      "isNext": false,
      "date": "August 7, 2018",
      "topic": "Launching the Micro Future: Groovy, Grails, and Micronaut",
      "abstract": "<p>In this talk, Jeff Brown will demonstrate how the future of Grails, GORM, and Micronaut are linked, as well as how the OCI Groovy and Grails team is taking productivity around developing microservices to the next level!</p><p>Micronaut is a new JVM-based, full-stack framework for building modular, easily testable microservice applications. Unlike reflection-based IoC frameworks, which load and cache reflection data for every single field, method, and constructor in your code, with Micronaut, your application startup time and memory consumption are not bound to the size of your codebase.</p><p>The Micronaut framework shares many core values with Grails, including the enablement of code simplicity and developer productivity. Micronaut offers many additional features for a new class of applications (e.g., microservices, serverless deployments, etc.) that may not be well-suited for Grails.</p> <p>Compelling aspects of the Micronaut framework include: <ul> <li> Sub-second startup time <li> Tiny processes that may run in as little as 8mb of heap <li> No runtime reflection <li> Dependency injection <li> Load balancing <li> And more! </ul></p>",
      "speaker": {
        "name": "Jeff Brown",
        "information": "<p>Jeff Scott Brown is the co-founder of the Grails and Micronaut frameworks, leads the Grails and Micronaut practices at OCI (objectcomputing.com), and is also Partner at OCI.  He has been doing JVM application development for as long as the JVM has existed. He has spent most of the last decade focused specifically on work related to the Grails framework, is a key contributor to the frameworks’ core development, and recently co-founded the Micronaut framework.</p><p>You can find Jeff on Twitter @jeffscottbrown (<a href='https://twitter.com/jeffscottbrown' target='_blank'>https://twitter.com/jeffscottbrown</a>)</p>"
      },
      "company": {
        "name": "OCI (Object Computing, Inc.)"
      },
      "location": "Ticketmaster, 7060 Hollywood Blvd, 3rd Floor, Hollywood, CA, 90028",
      "host": "Marco Villalobos"
    },
    {
      "isNext": false,
      "date": "July 10, 2018",
      "topic": "Bad Things Happen - Recognizing the Common Pitfalls in Java Concurrency Programming",
      "abstract": "This presentation is about recognizing common mistakes and misunderstandings with concurrency programming on the Java platform.",
      "speaker": {
        "name": "Marco Villalobos, LAJUG President",
        "information": "Marco Villalobos is a Software Engineer, and the Los Angeles Java Users' Group President."
      },
      "location": "Ticketmaster, 7060 Hollywood Blvd, 3rd Floor, Hollywood, CA, 90028",
      "host": "Marco Villalobos",
      "youtube": {
        "stream": "https://youtu.be/5P1pbu63Elo",
        "embed": "https://www.youtube.com/embed/5P1pbu63Elo"
      }
    }
  ]
}
